
{"intents":[
  { "tag": "saudacao",
    "patterns":["Ola","Opa","Oi", "tudo bem"],
    "responses": ["Oi","Ola", "Oie, espero que esteja bem!"]
  },
  { "tag": "despedida",
    "patterns":["valeu","tchau","Obrigado","tks"],
    "responses": ["Ate breve","Falou", "Tchauzinho!"]
  },
  { "tag": "introducao_tcc",
    "patterns":["Como eh um tcc?","Por que fazer o tcc?"],
    "responses": ["O TCC eh  uma avaliacao que acontece quando a graduacao esta chegando ao fim. Ele tem o objetivo de fazer com que o aluno coloque no papel tudo o que aprendeu até o momento, desde o inicio dos estudos. Assim, eh possivel saber se tudo foi absorvido e entendido corretamente."]
  },
  { "tag": "tema_tcc",
    "patterns":["Tema","Como escolher o tema?", "Tema ciencia da computacao"],
    "responses": ["O tema de uma monografia deve ser o mais especifico possivel, nao pode ser um assunto muito aberto. Um assunto unico e especifico possibilita um melhor aprofundamento e faz com que os leitores do TCC, principalmente a banca examinadora, criem as expectativas corretas, sabendo exatamente o que sera abordado na pesquisa."]
  },
  { "tag": "opcao_tema_tcc",
    "patterns":["Tema ciencia da computacao", "Opcoes de tema"],
    "responses": ["Criacao de ChatBot para avaliacao do estado mental dos funcionarios do Metro de SP", "Como podemos anonimizar automaticamente as imagens das pessoas em gravacoes de video", "Deteccao de fraudes em cartoes de credito com aprendizado de maquina", "Analise de sentimentos em redes sociais"]
  },
  { "tag": "integrantes_tcc",
  "patterns":["Grupo","Com quantas pessoas posso fazer tcc?", "Quantidade de integrantes", "Posso fazer grupo de um?", "Posso fazer grupo com pessoas de outro curso?", "Posso fazer sozinho?"],
  "responses": ["Eh recomendado o grupo de TCC ter 4 pessoas, mas pode-se fazer com menos pessoas, tendo em vista que ainda sera esperado um trabalho digno de quatro \n integrantes, ou mais pessoas, mas tendo mais pessoas sera esperado que o trabalho reflita essa diferenca. "]
  },
  { "tag": "banca_tcc",
  "patterns":["Quem avalia?","Quantos avaliadores?", "Como eh a banca?", "Banca"],
  "responses": ["Sao 3 avaliadores."]
  },
  { "tag": "orientador_tcc",
  "patterns":["Quem pode ser meu orientador?","Como escolho um orientador?", "Meu orientador pode ser de outro curso?"],
  "responses": ["Seu orientador pode ser qualquer professor da FEI de qualquer curso. E interessante que seja alguem com quem tenha uma boa relacao e em quem confie.\n Alem disso eh importante que a area de seu tema seja algo com que ele ou ela esteja familiarizado."]
  },
  { "tag": "funcao_orientador_tcc",
  "patterns":["Por que preciso de um orientador","Qual a funcao de um orientador?", "Para que preciso de um orientador?"],
  "responses": ["O orientador eh quem vai acompanhar o projeto de perto e guia-los durante o processo, orientado quanto a qualidade do seu trabalho, qual o proximo passo e ajudar na tomada de decisoes. "]
  },
  { "tag": "apresentacao_tcc",
  "patterns":["Quem pode ver minha apresentacao?", "minha familia pode vir", "posso trazer meu namorado","posso trazer minha namorada","pode vir gente de fora"],
  "responses": ["Qualquer pessoa pode assistir sua apresentacao", "Pode vir todo mundo!"]
  },
  { "tag": "data_tcc",
  "patterns":["Qual a data final?", "Que dia devo apresentar meu tcc?", "Qual horario de apresentacao?"],
  "responses": ["Usualmente a data de avaliacao eh no fim do semestre durante a epoca da P3."]
  },
  { "tag": "divergencia_tcc",
    "patterns":["Entre meu professor de TCC e meu orientador, quem tem a decisao final?","Se meu orientador e professor discordam quem eu sigo?"],
    "responses": ["No caso do seu professor de TCC e orientador terem opinioes distintas, siga seu orientador, \n ele tem uma visao mais aprofundada de seu projeto e pode dar instrucoes mais precisas.\n Entretanto vale a pena pedir para seu orientador conversar com seu professor!"]
  }]
}